---
kind: method
id: M:Autodesk.Revit.DB.GeomCombinationSet.GetEnumerator
source: html/9dab75f8-c0bd-81de-1c05-c3c48e7c98be.htm
---
# Autodesk.Revit.DB.GeomCombinationSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.